---
kind: property
id: P:Autodesk.Revit.DB.ExportPatternKey.OriginalFillPatternName
source: html/023895ac-a5e7-1a74-d040-a4110e71b365.htm
---
# Autodesk.Revit.DB.ExportPatternKey.OriginalFillPatternName Property

The original FillPattern name.

## Syntax (C#)
```csharp
public string OriginalFillPatternName { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null